package test;

public class test1 {
	public static void main(String [] args)
	{
		//0000 0000 0111 1111 16진수
		//0 000 000 001 111 111 8진수
		//0000000001111111 10진수
		/*
		int sixteen1 = (0*(2*2*2*2))+(0*(2*2*2))+(0*(2*2))+(0*2)+(0*1);
		int sixteen2 = (0*(2*2*2*2))+(0*(2*2*2))+(0*(2*2))+(0*2)+(0*1);
		int sixteen3 = (0*(2*2*2*2))+(1*(2*2*2))+(1*(2*2))+(1*2)+(1*1);
		int sixteen4 = (1*(2*2*2*2))+(1*(2*2*2))+(1*(2*2))+(1*2)+(1*1);		
		System.out.println(sixteen1+sixteen2+sixteen3+sixteen4);
		
		int Eight1 = (1*(2*2*2*2))+(1*(2*2*2))+(1*(2*2))+(1*2)+(1*1);
		int Eight2 = (0*(2*2*2*2))+(0*(2*2*2))+(0*(2*2))+(0*2)+(0*1);
		int Eight3 = (0*(2*2*2*2))+(1*(2*2*2))+(1*(2*2))+(1*2)+(1*1);
		int Eight4 = (1*(2*2*2*2))+(1*(2*2*2))+(1*(2*2))+(1*2)+(1*1);		
		System.out.println(Eight1+Eight2+Eight3+Eight4);		
		*/
		
		
		
	}
}
